class Constants {
  static const String imagePath = 'assets/images';
  static const bool isLoggedIn = false;
  static const String uniqueId = 'ffc22d20-d7db-11ef-97aa-5b10ceba786f';
  static const String tokenKey = "key1";
  static const String privacyRegulationText = '''
ברוכים הבאים ל-לוטונט!
תקנון זה מהווה את הבסיס החוקי לשימוש בשירותי החברה. אנא קרא אותו בעיון. השימוש בשירותי החברה מהווה הסכמה בלתי חוזרת לתנאי התקנון.

1. הגדרות:
1.1. "החברה" – לוטונט בע"מ, המספקת שירותי שליחת טפסי לוטו באופן מקוון.
1.2. "השירות" – שליחה מקוונת של טפסי לוטו באמצעות האפליקציה או האתר.
1.3. "המשתמש" – כל אדם אשר עושה שימוש בשירותי החברה.
1.4. "טופס לוטו" – טופס הכולל בחירה של מספרים להשתתפות בהגרלות הלוטו, בהתאם לכללים של מפעל הפיס או גוף מוסמך אחר.

2. תנאי שימוש:
2.1. השירות ניתן ללקוחות מעל גיל 18 בלבד.
2.2. המשתמש מאשר כי הוא מודע לכך שהשירות הוא שירות מקוון בלבד ואינו מתבצע פיזית על ידי המשתמש עצמו.
2.3. המשתמש מתחייב לספק פרטים נכונים ומדויקים בעת ההרשמה לשירות.

3. אחריות החברה:
3.1. החברה אחראית לוודא שהטפסים נשלחים במועד שנקבע על ידי המשתמש.
3.2. החברה אינה נושאת באחריות לכל תקלה טכנית שאינה בשליטתה (לדוגמה: תקלות אינטרנט או תקלות טכניות במערכת הלוטו).
3.3. במידה והחברה לא הצליחה לשלוח טופס מסיבה כלשהי, האחריות מוגבלת להחזר התשלום עבור השירות בלבד.

4. אחריות המשתמש:
4.1. המשתמש אחראי לבדוק את ההנחיות ואת המידע המפורסם באתר החברה בנוגע להגרלות ולמועדים.
4.2. המשתמש מצהיר כי השימוש בשירות נעשה בהתאם לחוקים החלים במדינה שבה הוא נמצא.

5. זכויות ותשלומים:
5.1. השירות כרוך בתשלום, בהתאם למחירון המפורסם באתר או באפליקציה.
5.2. החברה שומרת לעצמה את הזכות לעדכן את מחירון השירותים מעת לעת.
5.3. זכייה בפרס:
כל סכום הזכייה יועבר למשתמש לאחר ניכוי עלויות המוסדרות בחוק או בתנאי השירות.
במקרה של זכייה קבוצתית, הסכום יחולק בין המשתתפים בהתאם להסכמות שנקבעו מראש.

6. פרטיות ואבטחת מידע:
6.1. החברה מתחייבת לשמור על פרטיות המשתמשים ולא למסור פרטים לצד שלישי, למעט במקרים הנדרשים על פי חוק.
6.2. פרטי המשתמשים מאובטחים באמצעים טכנולוגיים מתקדמים על פי התקנים המחמירים ביותר.
''';

  static const String ageRegulationContent = '''
ברוכים הבאים ל-לוטונט!
תקנון זה מהווה את הבסיס החוקי לשימוש בשירותי החברה. אנא קרא אותו בעיון. השימוש בשירותי החברה מהווה הסכמה בלתי חוזרת לתנאי התקנון.

1. הגדרות:
   1.1. "החברה" – לוטונט בע"מ, המספקת שירותי שליחת טפסי לוטו באופן מקוון.  
   1.2. "השירות" – שליחה מקוונת של טפסי לוטו באמצעות האפליקציה או האתר.  
   1.3. "המשתמש" – כל אדם אשר עושה שימוש בשירותי החברה.  
   1.4. "טופס לוטו" – טופס הכולל בחירה של מספרים להשתתפות בהגרלות הלוטו, בהתאם לכללים של מפעל הפיס או גוף מוסמך אחר.  

2. תנאי שימוש:
   2.1. השירות ניתן ללקוחות מעל גיל 18 בלבד.  
   2.2. המשתמש מאשר כי הוא מודע לכך שהשירות הוא שירות מקוון בלבד ואינו מתבצע פיזית על ידי המשתמש עצמו.  
   2.3. המשתמש מתחייב לספק פרטים נכונים ומדויקים בעת ההרשמה לשירות.  

3. אחריות החברה:
   3.1. החברה אחראית לוודא שהטפסים נשלחים במועד שנקבע על ידי המשתמש.  
   3.2. החברה אינה נושאת באחריות לכל תקלה טכנית שאינה בשליטתה (לדוגמה: תקלות אינטרנט או תקלות טכניות במערכת הלוטו).  
   3.3. במידה והחברה לא הצליחה לשלוח טופס מסיבה כלשהי, האחריות מוגבלת להחזר התשלום עבור השירות בלבד.  

4. אחריות המשתמש:
   4.1. המשתמש אחראי לבדוק את ההנחיות ואת המידע המפורסם באתר החברה בנוגע להגרלות ולמועדים.  
   4.2. המשתמש מצהיר כי השימוש בשירות נעשה בהתאם לחוקים החלים במדינה שבה הוא נמצא.  

5. זכויות ותשלומים:
   5.1. השירות כרוך בתשלום, בהתאם למחירון המפורסם באתר או באפליקציה.  
   5.2. החברה שומרת לעצמה את הזכות לעדכן את מחירון השירותים מעת לעת.  
   5.3. זכייה בפרס:  
        - כל סכום הזכייה יועבר למשתמש לאחר ניכוי עלויות המוסדרות בחוק או בתנאי השירות.  
        - במקרה של זכייה קבוצתית, הסכום יחולק בין המשתתפים בהתאם להסכמות שנקבעו מראש.  

6. פרטיות ואבטחת מידע:
   6.1. החברה מתחייבת לשמור על פרטיות המשתמשים ולא למסור פרטים לצד שלישי, למעט במקרים הנדרשים על פי חוק.  
   6.2. פרטי המשתמשים מאובטחים באמצעים טכנולוגיים מתקדמים על פי התקנים המחמירים ביותר.
''';
}
